In [1]:
1#import pandas
import pandas as pd

In [2]:
2#Print the version of pandas that has been imported.
pd.__version__

'2.2.3'

In [3]:
3#3. Print out all the version information of the libraries that are required by the pandas library.
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : 0691c5cf90477d3503834d983f69350f250a6ff7
python                : 3.11.4
python-bits           : 64
OS                    : Windows
OS-release            : 10
Version               : 10.0.22631
machine               : AMD64
processor             : Intel64 Family 6 Model 154 Stepping 4, GenuineIntel
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_India.1252

pandas                : 2.2.3
numpy                 : 1.25.1
pytz                  : 2024.2
dateutil              : 2.8.2
pip                   : 23.2
Cython                : None
sphinx                : None
IPython               : 8.30.0
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : 4.12.3
blosc                 : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
html5lib              : None
hypothesis            : None
gcsfs                 : None
jinja2                : 3.1.4
lxml.etree            : None
matplotlib            : 3.7.2
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : None
pandas_gbq            : None
psycopg2              : None
pymysql               : None
pyarrow               : None
pyreadstat            : None
pytest                : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : 1.11.1
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
xlsxwriter            : None
zstandard             : None
tzdata                : 2024.2
qtpy                  : None
pyqt5                 : None

In [4]:
#4 import numpy as np
import numpy as np

In [5]:
#5 usind data and labels data create a dataframe
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [6]:
df =pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [7]:
6#display the dataframe info
df.info

<bound method DataFrame.info of   animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no>

In [8]:
#7. Return the first 3 rows of the DataFrame df
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [9]:
#8. Select just the 'animal' and 'age' columns from the DataFrame df.
df[['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [10]:
9#Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].
df.loc[df.index[[3, 4, 8]],['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [11]:
#10 Select only the rows where the number of visits is greater than 3.
df[df['visits'] > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

In [12]:
#11 Select the rows where the age is missing, i.e. it is NaN.
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [13]:
#12Select the rows where the animal is a cat and the age is less than 3
df[(df['animal']=='cat')& (df['age']<3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [14]:
#13 . Select the rows the age is between 2 and 4 (inclusive).
df[df['age'].between(2,4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

In [15]:
#14  Change the age in row 'f' to 1.5.
df.loc['age','f'] =1.5

In [16]:
#15 Calculate the sum of all visits in df (i.e. find the total number of visits).
df['visits'].sum()

19.0

In [17]:
#16 Calculate the mean age for each different animal in df.
df.groupby('animal')['age'].mean()

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

In [18]:
# 17 Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.
df.loc['k'] =['dog',5.5,3,6,2]
df =df.drop('k')

In [19]:
# 18 Count the number of each type of animal in df.
df['animal'].value_counts()

animal
cat      4
dog      4
snake    2
Name: count, dtype: int64

In [20]:
# 19 Sort df first by the values in the 'age' in decending order, 
#then by the value in the 'visits' column in ascending order (so row i should be first, and row d should be last).
df.sort_values(by=['age', 'visits'], ascending=[False, True])

    animal  age  visits priority    f
i      dog  7.0     2.0       no  NaN
e      dog  5.0     2.0       no  NaN
g    snake  4.5     1.0       no  NaN
j      dog  3.0     1.0       no  NaN
b      cat  3.0     3.0      yes  NaN
a      cat  2.5     1.0      yes  NaN
f      cat  2.0     3.0       no  NaN
c    snake  0.5     2.0       no  NaN
h      cat  NaN     1.0      yes  NaN
d      dog  NaN     3.0      yes  NaN
age    NaN  NaN     NaN      NaN  1.5

In [21]:
# 20 The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.
df['priority'] = df['priority'].map{['yes':'True','no'='False']

SyntaxError: invalid syntax (3248517656.py, line 2)

In [22]:
df['animal'] = df['animal'].replace('snake', 'python')

In [23]:
df['animal']

a         cat
b         cat
c      python
d         dog
e         dog
f         cat
g      python
h         cat
i         dog
j         dog
age       NaN
Name: animal, dtype: object

In [24]:
#21 in  the 'animal' column, change the 'snake' entries to 'python'.
df['animal']=df['animal'].replace('snake','python')

In [25]:
#22  For each animal type and each number of visits, find the mean age.
#In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).
df. pivot_table(index='visits', columns='animal', values='age',aggfunc='mean')

animal  cat  dog  python
visits
1.0     2.5  3.0     4.5
2.0     NaN  6.0     0.5
3.0     2.5  NaN     NaN

In [30]:
# # 23 You have a DataFrame df with a column 'A' of integers. For example:
# df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
# How do you filter out rows which contain the same integer as the row immediately above?
# You should be left with a column containing the following values:
# 1, 2, 3, 4, 5, 6, 7
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df.loc[df['A'].shift()!=df['A']]

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [31]:
#24 Given a DataFrame of numeric values, say
# df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
# how do you subtract the row mean from each element in the row
df =pd.DataFrame(np.random.random(size=(5,5)))
df

          0         1         2         3         4
0  0.368307  0.963247  0.245458  0.679562  0.336684
1  0.335240  0.879757  0.073995  0.271687  0.504993
2  0.680028  0.687735  0.216199  0.985290  0.591322
3  0.051540  0.046996  0.902581  0.358381  0.749342
4  0.003986  0.377802  0.155565  0.903466  0.535067

In [32]:
# #25 Suppose you have DataFrame with 10 columns of real numbers, for example:
# df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
# Which column of numbers has the smallest sum? Return that column's label.
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df.sum().idxmin()

'g'

In [33]:
# 26 How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
len(df) - df.duplicated(keep=False).sum()
# or perhaps more simply...
len(df.drop_duplicates(keep=False))

2

In [34]:
# 27. A DataFrame has a column of groups 'grps' and and column of integer values 'vals':
# df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
#                    'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
# For each group, find the sum of the three greatest values. You should end up with the answer as follows:
# grps
# a    409
# b    156
# c    34
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
df

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

In [38]:
df.groupby('grps')['vals'].sum()

grps
a    416
b    160
c    380
Name: vals, dtype: int64

In [39]:
# 28 Datatime practice 
#Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers. Let's call this Series s.
dtime =pd.date_range(start='2015-01-01', end='2015-12-31',freq ='B')
s =pd.Series(np.random.rand(len(dtime)),index=dtime)
s

2015-01-01    0.882989
2015-01-02    0.156478
2015-01-05    0.222857
2015-01-06    0.453455
2015-01-07    0.602299
                ...
2015-12-25    0.734323
2015-12-28    0.367715
2015-12-29    0.014668
2015-12-30    0.722492
2015-12-31    0.536865
Freq: B, Length: 261, dtype: float64

In [ ]:
#########Data Cleaning#############

In [43]:
# 29 Some values in the the FlightNumber column are missing (they are NaN). These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place.
# Modify df to fill in these missing numbers and make the column an integer column (instead of a float column).
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

In [44]:
df['FlightNumber']=df['FlightNumber'].interpolate().astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [ ]:
# 30 The From_To column would be better as two separate columns! 
#Split each string on the underscore delimiter _ to give a new temporary DataFrame called 'temp' with the correct values.
#Assign the correct column names 'From' and 'To' to this temporary DataFrame.

In [45]:
temp =df.From_To.str.split('_',expand=True)
temp.columns =['From','To']
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [49]:
#31  40. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame 'temp'. 
#Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)
temp['From']=temp['From'].str.capitalize()
temp['To']=temp['To'].str.capitalize()

In [52]:
#32 Delete the From_To column from 41. Delete the From_To column from df and attach the temporary DataFrame 'temp' from the previous questions.
#df and attach the temporary DataFrame from the previous questions.
df =df.drop('From_To',axis =1)
df =df.join(temp)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [55]:
#33. In the Airline column, you can see some extra puctuation and symbols have appeared around the airline names. 
#Pull out just the airline name. E.g. '(British Airways. )' should become 'British Airways'.
df['Airline'] =df['Airline'].str.extract('([a-zA-Z\s]+)', expand=False).str.strip()

In [56]:
#  34 In the RecentDelays column, the values have been entered into the DataFrame as a list.
# We would like each first value in its own column, each second value in its own column, and so on. 
# If there isn't an Nth value, the value should be NaN.
# Expand the Series of lists into a new DataFrame named 'delays', rename the columns 'delay_1', 'delay_2', etc.
# and replace the unwanted RecentDelays column in df with 'delays'.
# there are several ways to do this, but the following approach is possibly the simplest

delays = df['RecentDelays'].apply(pd.Series)
delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]
df = df.drop('RecentDelays', axis=1).join(delays)
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM,London,Paris,23.0,47.0,NaN
1,10055,Air France,Madrid,Milan,NaN,NaN,NaN
2,10065,British Airways,London,Stockholm,24.0,43.0,87.0
3,10075,Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,Brussels,London,67.0,32.0,NaN